export const ERROR_MESSAGES = {
  // Common
  C001: "입력 내용을 확인해 주세요",
  C002: "찾을 수 없는 내용이에요",
  C003: "잠시 후 다시 시도해 주세요",
 
  // Auth 
  A001: "로그인 중 오류가 발생했어요",
  A002: "지원하지 않는 로그인 방식이에요",
  A003: "다시 로그인이 필요해요",
  A004: "다시 로그인이 필요해요", 
  A005: "다시 로그인이 필요해요",
 
  // User
  U001: "다시 로그인해 주세요",
 
  // Sushi
  S001: "존재하지 않는 카테고리예요",
  S002: "존재하지 않는 초밥 유형이에요", 
  S003: "더 이상 존재하지 않는 게시글이에요",
  S004: "답변 시간이 지난 게시글이에요",
  S005: "접근할 수 없는 게시글이에요",
 
  // Answer
  R001: "이미 답변이 모두 채워졌어요",
  R002: "존재하지 않는 답변이에요",
  R003: "이미 좋아요를 누른 답변이에요",
  R004: "자신의 답변에는 좋아요를 누를 수 없어요",
 
  // Notification
  N001: "존재하지 않는 알림이에요",
 
  // Default
  DEFAULT: "오류가 발생했어요. 잠시 후 다시 시도해 주세요"
 };